Tekla Open API Reference for Tekla Structures 2025
MeshItem.Export Method
 Exports the rebar item in the catlog to given file name. If path is not given rebar is exported to model folder. If filename is empty rebar name is used as filename.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Export(
	ref string filename
)
Public Function Export (
	ByRef filename As String
) As Boolean
Parameters
filename
Type: System.String
The export file name of the item.
Return Value
Type: Boolean
True on success.
Examples
using System;
using Tekla.Structures.Catalogs;
public class Example
{
       public void Example1()
       {
           RebarItem item = new RebarItem();
           if (item.Select("A500HW", "10", RebarItem.MAIN_USAGE))
           {
               string filename = System.IO.Path.GetTempPath() + "\\" + "A500HW_10_MAIN";
               if (item.Export(ref filename))
               {
                   Console.WriteLine("A500HW exported successfully");
               }
           }
       }
}
See Also
Reference
MeshItem Class
Tekla.Structures.Catalogs Namespace